#### DWFImageFormat Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing possible image format for DWF Export.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum DWFImageFormat ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DWFImageFormat ``` |

| Visual C++ |
| --- |
| ``` public enum class DWFImageFormat ``` |

# Members

| Member name | Description |
| --- | --- |
| Lossless |  |
| Lossy |  |

# See Also

Autodesk.Revit.DB Namespace